<a href="https://colab.research.google.com/github/Jake0925/Pandas/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. Basic

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
exam_data = {'이름' : ['서준', '우현', '인아', '영철'],
             '수학' : [90, 80, 70, 30],
             '영어' : [98, 89, 95, 22],
             '음악' : [85, 95, 100, 55],
             '체육' : [100, 90, 90, 77]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3  영철  30  22   55   77

칼럼과 행 추가

In [ ]:
# 컬럼을 추가한다
df['국어'] = 80
print(df, "\n")

# 행을 추가한다
df.loc[4] = 0
print(df, "\n")

# 값을 지정해서 행을 추가한다
df.loc[5] = ['동규', 90, 80, 60, 70, 50]
print(df, "\n")

# 행추가 - 기존 행 복사
df.loc['영철행 복사'] = df.loc[3]
print(df, "\n")

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3  영철  30  22   55   77  80

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3  영철  30  22   55   77  80
4   0   0   0    0    0   0

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80
3  영철  30  22   55   77  80
4   0   0   0    0    0   0
5  동규  90  80   60   70  50

        이름  수학  영어   음악   체육  국어
0       서준  90  98   85  100  80
1       우현  80  89   95   90  80
2       인아  70  95  100   90  80
3       영철  30  22   55   77  80
4        0   0   0    0    0   0
5       동규  90  80   60   70  50
영철행 복사  영철  30  22   55   77  80

인덱스 변경

In [ ]:
#이름 열을 인덱스로 지정
df.set_index('이름', inplace=True)
print(df, "\n")

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
영철  30  22   55   77  80
0    0   0    0    0   0
동규  90  80   60   70  50
영철  30  22   55   77  80

셀값 변경

In [ ]:
# 특정 셀의 값을 변경
df.iloc[0][3] = 99
print(df, "\n")

df.loc['서준']['체육'] = 11
print(df, "\n")

df.loc['서준', '체육'] = 22
print(df, "\n")

# 여러개의 값을 한꺼번에 변경하기
df.loc['서준', ['음악', '체육']] = 50
print(df, "\n")

df.loc['서준', ['음악', '체육']] = [60, 61]
print(df, "\n")

    수학  영어   음악  체육  국어
이름
서준  90  98   85  99  80
우현  80  89   95  90  80
인아  70  95  100  90  80
영철  30  22   55  77  80
0    0   0    0   0   0
동규  90  80   60  70  50
영철  30  22   55  77  80

    수학  영어   음악  체육  국어
이름
서준  90  98   85  11  80
우현  80  89   95  90  80
인아  70  95  100  90  80
영철  30  22   55  77  80
0    0   0    0   0   0
동규  90  80   60  70  50
영철  30  22   55  77  80

    수학  영어   음악  체육  국어
이름
서준  90  98   85  22  80
우현  80  89   95  90  80
인아  70  95  100  90  80
영철  30  22   55  77  80
0    0   0    0   0   0
동규  90  80   60  70  50
영철  30  22   55  77  80

    수학  영어   음악  체육  국어
이름
서준  90  98   50  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
영철  30  22   55  77  80
0    0   0    0   0   0
동규  90  80   60  70  50
영철  30  22   55  77  80

    수학  영어   음악  체육  국어
이름
서준  90  98   60  61  80
우현  80  89   95  90  80
인아  70  95  100  90  80
영철  30  22   55  77  80
0    0   0    0   0   0
동규  90  80   60  70  50
영철  30  22   55  77  80

In [ ]:
# 조건문
df.loc[(df['국어']>70) & (df['국어']<=95), '국어'] = 'Pass'
print(df, "\n")

    수학  영어   음악  체육    국어
이름
서준  90  98   60  61  Pass
우현  80  89   95  90  Pass
인아  70  95  100  90  Pass
영철  30  22   55  77  Pass
0    0   0    0   0     0
동규  90  80   60  70    50
영철  30  22   55  77  Pass

# 2. 문자열(str) 처리법
- https://blog.naver.com/wideeyed/221603778414
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.extract.html#pandas.Series.str.extract

In [ ]:
# example sample
df = pd.DataFrame({'email':['happy@gmail.com', 
                            '1004@NAVER.COM', 
                            'manse@yahoo.co.kr']}) 
df

               email
0    happy@gmail.com
1     1004@NAVER.COM
2  manse@yahoo.co.kr

1) 클렌징 - 문자 앞, 뒤의 한칸의 공백을 제거합니다.

In [ ]:
df['email_strip']  = df['email'].str.strip()  # 앞 뒤 공백을 제거
df['email_lstrip'] = df['email'].str.lstrip() # 앞 공백을 제거
df['email_rstrip'] = df['email'].str.rstrip() # 뒤 공백을 제거 
df

               email        email_strip       email_lstrip       email_rstrip
0    happy@gmail.com    happy@gmail.com    happy@gmail.com    happy@gmail.com
1     1004@NAVER.COM     1004@NAVER.COM     1004@NAVER.COM     1004@NAVER.COM
2  manse@yahoo.co.kr  manse@yahoo.co.kr  manse@yahoo.co.kr  manse@yahoo.co.kr

2) 패딩
- 고정길이 데이터를 이용해야 하는경우 왼쪽 또는 오른쪽 또는 중앙에 놓고 패딩합니다.

In [ ]:
df = pd.DataFrame({'email':['happy@gmail.com', 
                            '1004@NAVER.COM', 
                            'manse@yahoo.co.kr']}) 

df['email_pad']    = df['email'].str.pad(width=20, side='left', fillchar='_') # 지정길이 패딩
df['email_center'] = df['email'].str.center(width=20, fillchar='_') # 중앙놓고 지정길이 패딩
df['email_ljust']  = df['email'].str.ljust(width=20, fillchar='_')  # 왼쪽놓고 지정길이 패딩
df['email_rjust']  = df['email'].str.rjust(width=20, fillchar='_')  # 오른쪽놓고 지정길이 패딩
df['email_zfill']  = df['email'].str.zfill(width=20)                # 지정길이 0패딩
df

               email  ...           email_zfill
0    happy@gmail.com  ...  00000happy@gmail.com
1     1004@NAVER.COM  ...  0000001004@NAVER.COM
2  manse@yahoo.co.kr  ...  000manse@yahoo.co.kr

[3 rows x 6 columns]

3) 분할, 구분자를 이용하여 새로운 컬럼을 생성합니다.

In [ ]:
df = pd.DataFrame({'email':['test@111@222@333',
                            'happy@gmail.com', 
                            '1004@NAVER.COM', 
                            'manse@yahoo.co.kr']}) 


# split(): 구분자를 기준으로 n개로 나눈다, expand=True이면 여러 컬럼, False이면 1개 컬럼에 리스트
df[['split_1', 'split_2', 'split_3']] = df['email'].str.split('@', n=2, expand=True)

# expand=False 인경우
df[['A']] = df['email'].str.split('@',  expand=False)

# partition(): 좌측에 먼저 출현한 구분자포함 3개로 나눈다
df[['partition_1', 'partition_2', 'partition_3']] = df['email'].str.partition(sep='@')

# rpartition(): 우측에 먼저 출현한 구분자포함 3개로 나눈다
df[['rpartition_1','rpartition_2', 'rpartition_3']] = df['email'].str.rpartition(sep='@')

# rsplit(): split와 동일하며 우측부터 탐색하며 n개로 나눈다
df['rsplit_1']     = df['email'].str.rsplit(pat='@')

df

               email split_1  ... rpartition_3               rsplit_1
0   test@111@222@333    test  ...          333  [test, 111, 222, 333]
1    happy@gmail.com   happy  ...    gmail.com     [happy, gmail.com]
2     1004@NAVER.COM    1004  ...    NAVER.COM      [1004, NAVER.COM]
3  manse@yahoo.co.kr   manse  ...  yahoo.co.kr   [manse, yahoo.co.kr]

[4 rows x 12 columns]

4) 소문자, 대문자, 앞자리대문자, 소문자 대문자 뒤집기 또는 치환합니다.

In [ ]:
df = pd.DataFrame({'email':['TEST@111@222@333',
                            'happy@gmail.com', 
                            '1004@NAVER.COM', 
                            'manse@yahoo.co.kr']}) 


df['lower']      = df['email'].str.lower()      # 모두 소문자로 변경
df['upper']      = df['email'].str.upper()      # 모두 대문자로 변경
df['capitalize'] = df['email'].str.capitalize() # 첫글자 한문자만 대문자 나머진 소문자로 변경
df['title']      = df['email'].str.title()      # 단위별 앞문자 대문자로 변경
df['swapcase']   = df['email'].str.swapcase()   # 첫글자가 소문자면 대문자, 대문자면 소문자로 변경 
df['replace']    = df['email'].str.replace(pat='.', repl='_', regex=False) # 입력 패턴 또는 글자를 대체, 예제에서는 .을 _로 변경

df

               email              lower  ...           swapcase            replace
0   TEST@111@222@333   test@111@222@333  ...   test@111@222@333   TEST@111@222@333
1    happy@gmail.com    happy@gmail.com  ...    HAPPY@GMAIL.COM    happy@gmail_com
2     1004@NAVER.COM     1004@naver.com  ...     1004@naver.com     1004@NAVER_COM
3  manse@yahoo.co.kr  manse@yahoo.co.kr  ...  MANSE@YAHOO.CO.KR  manse@yahoo_co_kr

[4 rows x 7 columns]

5)  문자열의 위치(=인덱스)를 찾습니다.

In [ ]:
df = pd.DataFrame({'email':['happy@gmail.com.aaa.bbb', 
                            '1004@NAVER.COM.ccc', 
                            'manse@yahoo.co.kr.ddd']}) 

df['find']    = df['email'].str.find(sub='.')           # 가장왼쪽 sub값 검색후 위치반환
df['index']   = df['email'].str.index(sub='.')          # 가장왼쪽 sub값 검색후 위치반환
df['rfind']   = df['email'].str.rfind(sub='.')          # 가장오른쪽 sub값 검색후 위치반환
df['rindex']  = df['email'].str.rindex(sub='.')         # 가장오른쪽 sub값 검색후 위치반환
df['findall'] = df['email'].str.findall(pat='[a-zA-Z]') # 알파벳 대소문자를 검색하여 모두 반환

df

                     email  ...                                            findall
0  happy@gmail.com.aaa.bbb  ...  [h, a, p, p, y, g, m, a, i, l, c, o, m, a, a, ...
1       1004@NAVER.COM.ccc  ...                  [N, A, V, E, R, C, O, M, c, c, c]
2    manse@yahoo.co.kr.ddd  ...  [m, a, n, s, e, y, a, h, o, o, c, o, k, r, d, ...

[3 rows x 6 columns]

6) 문자열의 특정 위치의 값 또는 슬라이싱을 통해 자르거나 자른 내용을 치환합니다.

In [ ]:
df = pd.DataFrame({'email':['abcdefg',
                            'ABCDEFG', 
                            '1234567']}) 

df['get']           = df['email'].str.get(i=0)    # 지정 위치의 문자 반환
df['slice']         = df['email'].str.slice(start=0, stop=3) # start 인덱스부터 stop전 인덱스까지 값 반환
df['slice_replace'] = df['email'].str.slice_replace(start=1, stop=3, repl='?') # 인덱스 사이 값을 다른 값으로 바꾼 후 값 반환

df

     email get slice slice_replace
0  abcdefg   a   abc        a?defg
1  ABCDEFG   A   ABC        A?DEFG
2  1234567   1   123        1?4567

7) 길이를 측정합니다. 패턴에 맞는 경우에만 개수를 반환하기도 합니다.

In [ ]:
df = pd.DataFrame({'email':['abcdefg',
                            'ABCDEFG', 
                            '1234567']}) 

df['email_len']   = df['email'].str.len()              # 길이 반환
df['email_count'] = df['email'].str.count(pat='[0-9]') # 문자열 중 패턴에 일치한 수 반환
 
df

     email  email_len  email_count
0  abcdefg          7            0
1  ABCDEFG          7            0
2  1234567          7            7

8) 숫자, 알파벳, 소문자인지 대문자인지 등을 확인합니다.

In [ ]:
df = pd.DataFrame({'email':['abcdefg',
                            'ABCDEFG', 
                            '1234567',
                            'Test1234567',
                            ' TEST 123 4567',
                            '  ']}) 

df['salnum']   = df['email'].str.isalnum()   # 알파벳 또는 숫자로만 구성 여부
df['isalpha']   = df['email'].str.isalpha()   # 알파벳으로만 구성 여부
df['isdecimal'] = df['email'].str.isdecimal() # 숫자문자로만 구성 여부
df['isdigit']   = df['email'].str.isdigit()   # 숫자문자로만 구성 여부
df['islower']   = df['email'].str.islower()   # 소문자로만 구성 여부
df['isnumeric'] = df['email'].str.isnumeric() # 숫자문자로만 구성 여부
df['isspace']   = df['email'].str.isspace()   # 빈칸상태 여부
df['istitle']   = df['email'].str.istitle()   # TitleCase형태로 구성 여부
df['isupper']   = df['email'].str.isupper()   # 대문자로만 구성 여부

df

            email  salnum  isalpha  ...  isspace  istitle  isupper
0         abcdefg    True     True  ...    False    False    False
1         ABCDEFG    True     True  ...    False    False     True
2         1234567    True    False  ...    False    False    False
3     Test1234567    True    False  ...    False     True    False
4   TEST 123 4567   False    False  ...    False    False     True
5                   False    False  ...     True    False    False

[6 rows x 10 columns]

9) 문자열의 시작 값 또는 종료 값 또는 특정 패턴과 일치하는 경우를 찾아냅니다.

In [ ]:
df = pd.DataFrame({'email':['happy@gmail.com',                           
                            'manse@yahoo.co.kr',
                            '1004@NAVER.COM.KR', 
                            'a1004@NAVER.COM.KR', 
                            '1004a@NAVER.COM.KR']}) 

df['startswith'] = df['email'].str.startswith(pat='h')     # 좌측값이 입력패턴과 일치 여부
df['endswith']   = df['email'].str.endswith(pat='com')     # 우측값이 입력패턴과 일치 여부
df['contains']   = df['email'].str.contains(pat='kr', regex=False) # 값 중 패턴포함 여부
df['match']      = df['email'].str.match(pat='[a-zA-Z@.]') # 구분자인 @앞에 첫문자가 알파벳인지 여부

df

                email  startswith  endswith  contains  match
0     happy@gmail.com        True      True     False   True
1   manse@yahoo.co.kr       False     False      True   True
2   1004@NAVER.COM.KR       False     False     False  False
3  a1004@NAVER.COM.KR       False     False     False   True
4  1004a@NAVER.COM.KR       False     False     False  False

# 3. 칼럼/로우 삭제하기 

https://wikidocs.net/47419

In [ ]:
from pandas import Series, DataFrame

data = [
    [112000, 112500, 109500, 110500],
    [114000, 114500, 110500, 111000],
    [113000, 115000, 112000, 115000],
    [111500, 112500, 110000, 111500],
    [111000, 114000, 109500, 112000],
 ]

columns = ["시가", "고가", "저가", "종가"]
index = ["2019-06-05", "2019-06-04", "2019-06-03", "2019-05-31", "2019-05-30"]
df = DataFrame(data=data, index=index, columns=columns)
df

                시가      고가      저가      종가
2019-06-05  112000  112500  109500  110500
2019-06-04  114000  114500  110500  111000
2019-06-03  113000  115000  112000  115000
2019-05-31  111500  112500  110000  111500
2019-05-30  111000  114000  109500  112000

In [ ]:
# 칼럼 삭제
df2 = df.drop("시가", axis=1) # '시가' 칼럼삭제
df2

                고가      저가      종가
2019-06-05  112500  109500  110500
2019-06-04  114500  110500  111000
2019-06-03  115000  112000  115000
2019-05-31  112500  110000  111500
2019-05-30  114000  109500  112000

In [ ]:
# 로우 삭제
df2=df.drop("2019-05-30", axis=0)
df2

                시가      고가      저가      종가
2019-06-05  112000  112500  109500  110500
2019-06-04  114000  114500  110500  111000
2019-06-03  113000  115000  112000  115000
2019-05-31  111500  112500  110000  111500

In [ ]:
# 원본데이터도 삭제하고 싶은경우 'inplace'속성사용
df.drop(["2019-05-31", "2019-05-30"], axis=0, inplace=True)
df

                시가      고가      저가      종가
2019-06-05  112000  112500  109500  110500
2019-06-04  114000  114500  110500  111000
2019-06-03  113000  115000  112000  115000

In [ ]:
import numpy as np
df = pd.DataFrame(np.random.randn(5, 3), columns=['C1', 'C2', 'C3'])
df

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1 -1.463311 -0.995482 -2.326013
2  0.000562 -2.405369 -0.000559
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

# 4. Nan(결측값) 대체

https://rfriend.tistory.com/262

셀값 변경

In [ ]:
df.loc[[1,2], 'C1'] = np.nan
df.iloc[2]['C2'] = np.nan
df.iloc[2]['C3'] = np.nan
df

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1       NaN -0.995482 -2.326013
2       NaN       NaN       NaN
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

Nan수를 특정한 단일값으로 채우기

In [ ]:
df_0 = df
df_0.fillna(0)

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.000000 -0.995482 -2.326013
2  0.000000  0.000000  0.000000
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

Nan수를 윗행의 값으로 채우기

In [ ]:
# 1) 
df_0 = df
df_0.fillna(method='ffill')

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.712543 -0.995482 -2.326013
2  0.712543 -0.995482 -2.326013
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

In [ ]:
# 2) 
df_0 = df
df_0.fillna(method='pad')

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.712543 -0.995482 -2.326013
2  0.712543 -0.995482 -2.326013
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

Nan수를 아래행의 값으로 채우기

In [ ]:
# 1)
df_0 = df
df_0.fillna(method='bfill')

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.889794 -0.995482 -2.326013
2  0.889794 -0.087976 -0.669509
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

In [ ]:
# 2)
df_0 = df
df_0.fillna(method='backfill')

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.889794 -0.995482 -2.326013
2  0.889794 -0.087976 -0.669509
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

결측값 채우기 개수 제한

In [ ]:
# 위에서 한개만 변경
df_0 = df
df_0.fillna(method='ffill', limit=1)

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.712543 -0.995482 -2.326013
2       NaN -0.995482 -2.326013
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

In [ ]:
# 아래서 한개만 변경
df_0 = df
df_0.fillna(method='bfill', limit=1)

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1       NaN -0.995482 -2.326013
2  0.889794 -0.087976 -0.669509
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

결측값을 평균으로 대체

In [ ]:
df_0 = df
df_0.mean()

C1    0.259822
C2   -0.176470
C3   -0.846402
dtype: float64

In [ ]:
# 각 colums별 평균값을 각 column의 Nan에 대입
df_0 = df
df_0.fillna(df.mean())

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.259822 -0.995482 -2.326013
2  0.259822 -0.176470 -0.846402
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

In [ ]:
# 모든 column의 nan에 특정한 평균값 대입
# 아래 예는 모든 nan값 위치에 ['C1']의 평균값 대입 
df_0 = df
df_0.fillna(df.mean()['C1'])

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.259822 -0.995482 -2.326013
2  0.259822  0.259822  0.259822
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932

In [ ]:
# 일부 column에 대해서만 각 column의 평균값대입
df_0 = df
df_0.fillna(df.mean()['C1':'C2'])

         C1        C2        C3
0  0.712543  0.407084 -0.473020
1  0.259822 -0.995482 -2.326013
2  0.259822 -0.176470       NaN
3  0.889794 -0.087976 -0.669509
4 -0.822871 -0.029506  0.082932